laravel/app/Models/Article.php

select `users`.*, `likes`.`article_id` as `pivot_article_id`, `likes`.`user_id` as `pivot_user_id`, `likes`.`created_at` as `pivot_created_at`, `likes`.`updated_at` as `pivot_updated_at` from `users` inner join `likes` on `users`.`id` = `likes`.`user_id` where `likes`.`article_id` = 14
---
    public function getArticle(Int $article_id)
    {
        return $this->with('user')->where('id', $article_id)->first();