laravel/app/Http/Controllers/ArticleController.php

select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id`, `article_tag`.`created_at` as `pivot_created_at`, `article_tag`.`updated_at` as `pivot_updated_at` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15)
select `users`.*, `likes`.`article_id` as `pivot_article_id`, `likes`.`user_id` as `pivot_user_id`, `likes`.`created_at` as `pivot_created_at`, `likes`.`updated_at` as `pivot_updated_at` from `users` inner join `likes` on `users`.`id` = `likes`.`user_id` where `likes`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15)
---
    public function index(Request $request)
    {
        // 無限スクロール
        $articles = Article::with(['user', 'likes', 'tags'])
        ->orderBy('created_at', 'desc')
        ->paginate(10);

select * from `tags`
---
    public function create()
    {
        $allTagNames = Tag::all()->map(function ($tag) {
            return ['text' => $tag->name];
        });

insert into `articles` (`title`, `body`, `user_id`, `updated_at`, `created_at`) values ('二重', 'test', 11, '2020-09-26 21:18:50', '2020-09-26 21:18:50')
insert into `article_tag` (`article_id`, `created_at`, `tag_id`, `updated_at`) values (15, '2020-09-26 15:17:01', 5, '2020-09-26 15:17:01')
---
    public function store(ArticleRequest $request, Article $article)
    {
        // 投稿をDBに保存
        $user = $request->user();
        $article = $user->articles()->create($request->all());
        $request->tags->each(function ($tagName) use ($article) {
            $tag = Tag::firstOrCreate(['name' => $tagName]);
            $article->tags()->attach($tag);