laravel/app/Http/Controllers/UserController.php

select `articles`.*, `likes`.`user_id` as `pivot_user_id`, `likes`.`article_id` as `pivot_article_id`, `likes`.`created_at` as `pivot_created_at`, `likes`.`updated_at` as `pivot_updated_at` from `articles` inner join `likes` on `articles`.`id` = `likes`.`article_id` where `likes`.`user_id` = 11
---
    public function show(string $name, Request $request, User $user)
    {
        // ユーザーの早起き達成日数を表示
        $user = $user->withCountAchievementDays($name);

        // ユーザー詳細ページのユーザーによる投稿一覧を10件ずつ取得
        $articles = $user->articles()
            ->orderBy('created_at', 'desc')
            ->paginate(10);