laravel/app/Http/Controllers/Auth/LoginController.php

    public function guestLogin()
    {
        $user = User::where('email', self::GUEST_USER_EMAIL)->first();
---
select * from `users` where `email` = 'guest@guest.com' limit 1