@extends('app')

@section('title', 'プライバシーポリシー')

@include('nav')

@section('content')

  <div class="container mt-4">

    <div class="row  justify-content-center">

      <div class="col-md-10">
        <div class="p-5 rounded" style="background-color: whitesmoke;">
          <h1 class="text-center mb-4 h2">プライバシーポリシー</h1>
          <div>
            ①個人情報の利用目的<br>
            <br>
            Asakotsu(以下当サービス)では、ユーザー登録、お問い合わせなどの際に、名前（ハンドルネーム）、メールアドレス等の個人情報をご登録いただく場合がございます。<br>
            <br>
            これらの個人情報は質問に対する回答や必要な情報を電子メールなどをでご連絡する場合に利用させていただくものであり、個人情報をご提供いただく際の目的以外では利用いたしません。<br>
            <br>
            ②個人情報の第三者への開示<br>
            <br>
            当サービスでは、個人情報は適切に管理し、以下に該当する場合を除いて第三者に開示することはありません。<br>
            <br>
            ・本人のご了解がある場合<br>
            <br>
            ・法令等への協力のため、開示が必要となる場合<br>
            <br>
            個人情報の開示、訂正、追加、削除、利用停止<br>
            <br>
            ご本人からの個人データの開示、訂正、追加、削除、利用停止のご希望の場合には、ご本人であることを確認させていただいた上、速やかに対応させていただきます。<br>
            <br>
            ③当サービスへの投稿・コメントおよび、当サイト上でのZoomミーティング作成について<br>
            <br>
            当サービスでは、スパム・荒らしへの対応として、投稿・コメント・Zoomミーティング作成の際に使用されたIPアドレスを記録しています。<br>
            <br>
            これはスパム・荒らし・サイバー攻撃への対応以外にこのIPアドレスを使用することはありません。加えて、次の各号に掲げる内容を含む投稿・コメント・Zoomミーティング作成は管理人の裁量によって承認せず、削除する事があります。<br>
            <br>
            ・特定の自然人または法人を誹謗し、中傷するもの。<br>
            <br>
            ・極度にわいせつな内容を含むもの。<br>
            <br>
            ・禁制品の取引に関するものや、他者を害する行為の依頼など、法律によって禁止されている物品、行為の依頼や斡旋などに関するもの。<br>
            <br>
            ・その他、公序良俗に反し、または管理人によって承認すべきでないと認められるもの。<br>
            <br>
            ④免責事項<br>
            <br>
            当サービスで掲載している画像の著作権・肖像権等は各権利所有者に帰属致します。権利を侵害する目的ではございません。<br>
            <br>
            当日からリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。<br>
            <br>
            当サービスのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が入り込んだり、情報が古くなっていることもございます。<br>
            <br>
            当サービスに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。<br>
          </div>
        </div>
      </div>

    </div>

  </div>

@endsection
