laravel/app/Http/Controllers/Zoom/MeetingController.php

select * from `meetings`
---
    public function index()
    {
        $meetings = Meeting::all()->sortByDesc('created_at');

update `meetings` set `topic` = 'double33', `agenda` = 'update', `start_time` = '2020-10-08T21:13', `meetings`.`updated_at` = '2020-09-28 22:13:30' where `id` = 10
---
        public function update(MeetingRequest $request, Meeting $meeting)
    {
        // ZoomAPIにミーティング更新のリクエスト
        $id = $meeting->meeting_id;
        $path = 'meetings/' . $id;
        // dd($id);
        $response = $this->client->zoomPatch($path, $request->zoomParams());
        // dd($response);

         // DBに更新後のミーティングを保存
         if($response->getStatusCode() === 204) {  // 204：ミーティング更新成功のHTTPステータスコード
            $meeting->fill($request->validated())->save();